Revit 2027 API
RepeaterBounds.GetUpperBound Method
 Returns the highest index of the array in the given dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetUpperBound(
	int dimension
)
Public Function GetUpperBound (
	dimension As Integer
) As Integer
public:
int GetUpperBound(
	int dimension
)
member GetUpperBound :
        dimension : int -> int
Parameters
dimension Int32
 The dimension.
Return Value
Int32
 The highest index of the array in the given dimension.
Exceptions
Exception | Condition
ArgumentException |  The dimension is invalid for these bounds.
InvalidOperationException |  The bounds must have at least one dimension.
Remarks
 The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1]. This method does not apply to zero dimensional bounds.
See Also
Reference
RepeaterBounds Class
Autodesk.Revit.DB Namespace